## Pandas-DataFrame And Series

Pandas is a pwerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneoustabular data structure with labeled axes (rows and columns).

In [1]:
import pandas as pd

In [3]:
## Series
# A Pandas series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

data = [1,2,3,4,5]
series = pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## Create a Series from dictionary
data =  {'a': 1,  'b': 2, 'c': 3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data = [10,20,30]
index = ['a', 'b', 'c']
pd.Series(data, index)

a    10
b    20
c    30
dtype: int64

In [8]:
## Dataframe
# create a Datafram from a dictionary of a list

data = {
    'Name': ['Mohamed', 'Zain', 'Omar'],
    'Age': [32, 4, 22],
    'City': ['Giessen', 'Marburg', 'Berlin']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age     City
0  Mohamed   32  Giessen
1     Zain    4  Marburg
2     Omar   22   Berlin
<class 'pandas.core.frame.DataFrame'>

In [9]:
import numpy as np
np.array(df)

array([['Mohamed', 32, 'Giessen'],
       ['Zain', 4, 'Marburg'],
       ['Omar', 22, 'Berlin']], dtype=object)

In [11]:
## Create a DataFrame from a list of Dictionaries

data =[
      {'Name':'Mohamed', 'Age': 32, 'City': 'Giessen'},
      {'Name':'Zain', 'Age': 4, 'City': 'Marburg'},
      {'Name':'Omar', 'Age': 22, 'City': 'Berlin'},
      {'Name':'Jack', 'Age': 34, 'City': 'Frankfurt'}
]

df=pd.DataFrame(data)
print(df)

      Name  Age       City
0  Mohamed   32    Giessen
1     Zain    4    Marburg
2     Omar   22     Berlin
3     Jack   34  Frankfurt

In [15]:
df = pd.read_csv("data.csv", encoding="ISO-8859-1")
df.head(10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
5,536365,22752,SET 7 BABUSHKA NESTING BOXES,2,12/1/2010 8:26,7.65,17850.0,United Kingdom
6,536365,21730,GLASS STAR FROSTED T-LIGHT HOLDER,6,12/1/2010 8:26,4.25,17850.0,United Kingdom
7,536366,22633,HAND WARMER UNION JACK,6,12/1/2010 8:28,1.85,17850.0,United Kingdom
8,536366,22632,HAND WARMER RED POLKA DOT,6,12/1/2010 8:28,1.85,17850.0,United Kingdom
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,12/1/2010 8:34,1.69,13047.0,United Kingdom

In [16]:
df.tail(10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541899,581587,22726,ALARM CLOCK BAKELIKE GREEN,4,12/9/2011 12:50,3.75,12680.0,France
541900,581587,22730,ALARM CLOCK BAKELIKE IVORY,4,12/9/2011 12:50,3.75,12680.0,France
541901,581587,22367,CHILDRENS APRON SPACEBOY DESIGN,8,12/9/2011 12:50,1.95,12680.0,France
541902,581587,22629,SPACEBOY LUNCH BOX,12,12/9/2011 12:50,1.95,12680.0,France
541903,581587,23256,CHILDRENS CUTLERY SPACEBOY,4,12/9/2011 12:50,4.15,12680.0,France
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [19]:
## Accessing Data From Dataframe
data =[
      {'Name':'Mohamed', 'Age': 32, 'City': 'Giessen'},
      {'Name':'Zain', 'Age': 4, 'City': 'Marburg'},
      {'Name':'Omar', 'Age': 22, 'City': 'Berlin'},
      {'Name':'Jack', 'Age': 34, 'City': 'Frankfurt'}
]

df=pd.DataFrame(data)
print(df)

      Name  Age       City
0  Mohamed   32    Giessen
1     Zain    4    Marburg
2     Omar   22     Berlin
3     Jack   34  Frankfurt

In [ ]:
type(df['Name'])

pandas.core.series.Series

In [ ]:
df.loc[0]

Name    Mohamed
Age          32
City    Giessen
Name: 0, dtype: object

In [30]:
df.iloc[0, : ]

Name    Mohamed
Age          32
City    Giessen
Name: 0, dtype: object

In [31]:
df

      Name  Age       City
0  Mohamed   32    Giessen
1     Zain    4    Marburg
2     Omar   22     Berlin
3     Jack   34  Frankfurt

In [36]:
df.iloc[2:,0]

2    Omar
3    Jack
Name: Name, dtype: object

In [37]:
## Accessing a specified element
df['Name']

0    Mohamed
1       Zain
2       Omar
3       Jack
Name: Name, dtype: object

In [38]:
df

      Name  Age       City
0  Mohamed   32    Giessen
1     Zain    4    Marburg
2     Omar   22     Berlin
3     Jack   34  Frankfurt

In [39]:
df.at[1, 'Age']

np.int64(4)

In [40]:
df.at[2, 'Name']

'Omar'

In [42]:
## Accessing a specified element using iat
df.iat[2, 2]

'Berlin'

In [43]:
df

      Name  Age       City
0  Mohamed   32    Giessen
1     Zain    4    Marburg
2     Omar   22     Berlin
3     Jack   34  Frankfurt

In [48]:
## Data Manipulation with Dataframe
# Adding a column
df['Salary'] = [50000, 60000, 70000, 80000]
df

      Name  Age       City  Salary
0  Mohamed   32    Giessen   50000
1     Zain    4    Marburg   60000
2     Omar   22     Berlin   70000
3     Jack   34  Frankfurt   80000

In [49]:
# Removing a column
df.drop('Salary', axis=1, inplace=True)

In [50]:
df

      Name  Age       City
0  Mohamed   32    Giessen
1     Zain    4    Marburg
2     Omar   22     Berlin
3     Jack   34  Frankfurt

In [51]:
## Add age to the column
df['Age']+=1

In [52]:
df

      Name  Age       City
0  Mohamed   33    Giessen
1     Zain    5    Marburg
2     Omar   23     Berlin
3     Jack   35  Frankfurt

In [53]:
df.drop(0)

   Name  Age       City
1  Zain    5    Marburg
2  Omar   23     Berlin
3  Jack   35  Frankfurt

In [54]:
df.drop(0, inplace = True)

In [55]:
df

   Name  Age       City
1  Zain    5    Marburg
2  Omar   23     Berlin
3  Jack   35  Frankfurt

In [57]:
data = pd.read_csv('data.csv', encoding='latin1')
df = pd.DataFrame(data)
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [ ]:
# Display the data types of each column
print("Data types: \n", df.dtypes)


# Describe the DataFrame
print("Statistical summary: \n", df.describe())

Data types:
 InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object
Statistical summary:
             Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

In [61]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000